
/*轮播图的克隆*/
var ul1 = document.getElementById("ul1")
var lis = ul1.children
var ul2 = document.getElementById("p1")
var lis2 = ul2.children

var lbts = [{
	src: "img/lb1.jpeg",
	h1: "和平精英",
	h2: "和平精英新赛季! 重启未来, 前方2050",
	children_index_src: "img/child_tp1.jpeg",
	index2_top: ["img/cs1.png", "和平精英", "当前版本：1.14.10", "更新时间:2021-07-23 15:07:00", "开发厂商:深圳市腾讯计算机系统...", "游戏分类:飞行射击",
		"游戏标签：生存 / 沙盒 / PVP / 合...", "高清画质 大屏畅享", "智能键位 还原端游", "安卓7.1 完美兼容", "极致多开 多屏操作", "自研引擎 极速畅快", "独家反外挂 公平竞技",
		"和平精英 电脑版模拟器"
	],
	index2_xlbt: ["img/xlb11.jfif", "img/xlb12.jfif", "img/xlb13.jfif", "img/xlb14.jfif", "img/xlb15.jfif"],
	index2_text: ["",
		"",
		"",
		"",
		"《和平精英》是腾讯光子工作室群自研打造的反恐军事竞赛体验手游，作为一款风靡全球的射击游戏，超大实景地图，极致的视听感受，次世代完美的画质，都离不开腾讯官方融了大量的技术，该游戏采用300人的团队共同研发，并且加入了虚拟引擎4技术，给您带来不一样震撼的竞技体验。",
		"【和平精英电脑版游戏特色一： 百人竞技】",
		"原汁原味还原端游手感和画面 由于游戏加入虚幻引擎4技术，成熟的细节渲染，实景地图的多样化再加上环境天气的变化，让场景更加逼真且更具代入感，更加细腻真实；高保真的听觉体验，真实的3D音效，重现端游的视听感受，让敌人的脚步声更加清晰，听声辨位更简单精准；百人竞技，真实弹道，完美的射击手感，让玩家感受端游最初的体验。",
		"【和平精英电脑版游戏特色二： 公平竞技】",
		"多元化模式点燃指尖战场 还原端游的集中战斗区域，多模式的娱乐玩法，更快的游戏节奏，给玩家带来超爽的战斗体验；一键组队，邀请好友语音开黑，随时随地与好友并肩作战；强大的反外挂系统，针对不同机型多样化适配，让游戏更加公平，更加顺畅！复杂多变的地形结构，多样化的真实载具，让玩家体验更真实的场景融合和飙车快感；生存和射击同时进行，让你过足射击瘾；全方面自由施展战术，再加上无处不在的游戏内社交体验，患难战场见真情！",
		"【和平精英电脑版游戏特色三： 大屏精准】",
		"和平精英电脑版，大屏操作更加流畅，和平精英电脑版手游稳定顺畅，完美兼容，在电脑上全方面自由施展战术，畅游射击快感，键鼠操作极致还原，大屏体验精准射击，建议使用腾讯手游安卓模拟器《腾讯手游助手》效果更佳，腾讯手游安卓模拟器特有的引擎——AOW引擎提高了玩家精准射击和瞄准技能，减少了游戏中的滞后和卡顿。",
		"建议使用腾讯手游模拟器即腾讯手游助手在电脑上玩《和平精英》",
		"必玩和平精英电脑版的几大理由：",
		"和平精英电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
		"和平精英电脑版，摆脱手机电量担忧，网络状态更加稳定",
		"和平精英电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
		"和平精英电脑版，键鼠操控拥有更大发挥空间",
	],
	index2_play: ["如何在电脑上用手游助手玩《和平精英》手游",
		"在官网下载手游助手模拟器",
		"运行 exe 文件完成安装",
		"打开手游助手模拟器并在右上方搜索栏输入和平精英",
		"在搜索结果中找到对应游戏并点击安装",
		"完成安装后，点击开始启动游戏",
		"在腾讯手游助手上畅玩和平精英电脑版",
	],

	index2_xgzx1: ["和平精英:哥斯拉联名军需!时装光效满满，真正的怪兽之王来了",
		"哈喽大家好!我是你们的老朋友小信。相信这段时间小伙伴们已经充分感受到哥斯拉的“魅力”了，除了海岛，连雨林和山谷也有...",
		"2021-06-0315:06:00",
		"img/xgzx12.png",
	],
	index2_xgzx2: ["和平精英鲨鱼哟变坏了，疯狂给纹身小妹点赞，直言自己好喜欢?",
		"最近，由虎牙直播的PEL和平精英S2赛季正在火爆进行中，这一次担任解说的主播有一点特殊，全平台只有一名主播是二路解说直...",
		"2021-05-19 11:05:00",
		"img/xgzx11.png",
	],
	index2_xgzx3: ["活久见!某游戏玩家标价5K售“袁爷爷”ID引众怒，官方坐不住了。",
		"游戏事每日报，新鲜大事早知道，各位老板大家好，我是萧宇。虽然很多网友都知道游戏圈很乱?毕竟随着互联网的发展，让这个...",
		"2021-05-2618:05:00",
		"img/xgzx13.png",
	],
}, {
	src: "img/lb2.jpeg",
	h1: "武功来了",
	h2: "轻操作,重策略塔防放置游戏",
	children_index_src: "img/child_tp2.jpeg",
	index2_top: ["img/cs2.png", "武功来了", "当前版本:1.15", "更新时间: 2021-08-0912:08:00", "开发厂商:上海瞬娱网络科技有限...", "游戏分类:休闲益智",
		"游戏标签：多人", "高清画质 大屏畅享", "智能键位 还原端游", "安卓7.1 完美兼容", "极致多开 多屏操作", "自研引擎 极速畅快", "独家反外挂 公平竞技", "武功来了 电脑版模拟器"
	],
	index2_xlbt: ["img/xlb21.jfif",
		"img/xlb21.jfif",
		"img/xlb23.jfif",
		"img/xlb24.jfif",
		"img/xlb25.jfif"
	],
	index2_text: [
		"《武功来了》是一款武侠题材的塔防类策略手游，游戏将放置合成和塔防元素玩法相结合，轻操作，重策略，消除和策略的完美结合,从无到有建立起自己的专属编队，来迎接前方的各种挑战。 你可以通过按照自己的喜好风格去收集和升级各种武侠角色，来发挥不同英雄的属性技能，去打败不同的敌人。有趣的玩法同时考验你的脑力和运气。",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
	],
	index2_play: ["如何在电脑上用手游助手玩《武功来了》手游",
		"在官网下载手游助手模拟器",
		"运行 exe 文件完成安装",
		"打开手游助手模拟器并在右上方搜索栏输入武功来了",
		"在搜索结果中找到对应游戏并点击安装",
		"完成安装后，点击开始启动游戏",
		"在腾讯手游助手上畅玩武功来了电脑版",
	],
	index2_xgzx1: ["《武功来了》8月4日震撼首发，共同赴—场江湖冒险",
		"“武侠”，对于我们来说总是有着一种难以割舍的情怀，这份情怀也使我们有过各种各样的武侠梦，新国潮水墨风休闲塔防手游《..",
		"2021-08-04 11:08:00",
		"img/xgzx21.jpeg",
	],
	index2_xgzx2: ["怎么用电脑玩武功来了，武功来了电脑版下载及设置",
		"《武功来了》是一款武侠题材的塔防类策略手游，游戏将放置合成和塔防元素玩法相结合，轻操作，重策略，消除和策略的完美结...",
		"2021-07-16 06:07:00",
		"img/xgzx22.jpeg",
	],
	index2_xgzx3: ["13号迎来大更新，1万钻石别乱花，凤凰于飞优化上架，凤求凰返场保底抽",
		"王者荣耀13号要迎来一次大更新，去年五五开黑节后续13号也是进行了一次更新，这次活动时间也是一样的，看来天美的这个时间...",
		"2021-05-0915:05:00",
		"img/xgzx23.png",
	],
}, {
	src: "img/lb3.jpeg",
	h1: "俄罗斯方块环游记",
	h2: "中国首款正版俄罗斯方块手游",
	children_index_src: "img/child_tp3.jpeg",
	index2_top: ["img/cs3.png", "俄罗斯方块环游记", "当前版本:1.80008.800008", "更新时间:2021-07-29 08:07:00", "开发厂商:深圳市腾讯计算机系统..",
		"游戏分类:休闲益智", "游戏标签:多人", "高清画质 大屏畅享", "智能键位 还原端游", "安卓7.1 完美兼容", "极致多开 多屏操作", "自研引擎 极速畅快", "独家反外挂 公平竞技",
		"俄罗斯方块环游记 电脑版模拟器"
	],
	index2_xlbt: ["img/xlb31.jfif", "img/xlb32.jfif", "img/xlb33.jfif", "img/xlb34.jfif", "img/xlb35.jfif"],
	index2_text: ["Tetris官方正版授权俄罗斯方块手游，5亿人都玩过的经典之作，9项吉尼斯世界纪录。趣味关卡、竞技PK，丰富玩法，应有尽有。酣畅指尖，消除减压，休闲益智，老少咸宜。",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
	],
	index2_play: ["如何在电脑上用手游助手玩《俄罗斯方块环游记》手游",
		"在官网下载手游助手模拟器",
		"运行 exe 文件完成安装",
		"打开手游助手模拟器并在右上方搜索栏输入俄罗斯方块环游记",
		"在搜索结果中找到对应游戏并点击安装",
		"完成安装后，点击开始启动游戏",
		"在腾讯手游助手上畅玩俄罗斯方块环游记电脑版",
	],
	index2_xgzx1: ["【俄罗斯方块环游记】七夕版本即将上线，新增七夕特别内容敬请期待!",
		"七夕是个“多情”的日子，小环游是个有情的游戏，七夕的小环游世界，当然要给方块超人们带来不一样的感受了!更新更新我门...",
		"2021-08-10 18:08:00",
		"img/xgzx31.png",
	],
	index2_xgzx2: ["【俄罗斯方块环游记】冒险寻宝玩法怎么参与?冒险寻宝通关注意事项在这里!",
		"冒险寻宝是《俄罗斯方块环游记》手游中的一个高难度副本关卡，当然，难度高也意味着奖励非常丰厚。大家参与冒险寻宝可以获...",
		"2021-08-11 09:08:00",
		"img/xgzx32.png",
	],
	index2_xgzx3: ["回归“小环游”，开启方块新旅程",
		"炎热的夏天终于要过去了，天空中飘来一阵阵凉爽的秋风。这正是出去游玩的好天气啊，火龙果(大误)再也不用担心自己被晒成...",
		"2020-09-14 10:09:00",
		"img/xgzx33.png",
	],
}, {
	src: "img/lb4.jpeg",
	h1: "王者荣耀",
	h2: "长枪掠火，王者荣耀新赛季，一战到底",
	children_index_src: "img/child_tp4.jpeg",
	index2_top: ["img/cs4.png", "王者荣耀", "当前版本:3.65.1.6", "2021-07-23 15:07:00", "开发厂商:深圳市腾讯计算机系统...", "游戏分类:角色扮演",
		"游戏标签:自走棋/竞技/MOBA ...", "高清画质 大屏畅享", "智能键位 还原端游", "安卓7.1 完美兼容", "极致多开 多屏操作", "自研引擎 极速畅快", "独家反外挂 公平竞技",
		"王者荣耀 电脑版模拟器"
	],
	index2_xlbt: ["img/xlb1.png", "img/xlb2.png", "img/xlb3.png", "img/xlb4.png", "img/xlb5.png"],
	index2_text: [
		"《王者荣耀》是腾讯官方天美工作室群推出的英雄竞技类手游，作为一款全新的公平竞技MOBA类游戏，《王者荣耀》主张团队荣耀，公平竞技，团队合作等特色，在同类游戏中可谓是独树一帜。 作为国民MOBA手游大作，1V1、3V3、5V5等多模式玩法都可随心体验，英雄阵容搭配，团队合作默契，实时跨区匹配，让你沉浸在热血沸腾酣畅淋漓的对战体验中，与好友一起登上最强王者巅峰宝座！",
		"还原MOBA体验，快速了解游戏特色",
		"【王者荣耀模拟器特色一：视觉盛宴，王者新时代】 游戏主界面升级成全景沉浸式大厅，整体风格东风韵味十足，在加上国风配色和传统饰形，让游戏画面变得更为精细。 次世代技术的结合，能给召唤师呈现超高清峡谷地图得视觉体验。",
		"【王者荣耀模拟器特色二：团队公平竞技，热血配合齐超神】",
		"原汁原味MOBA体验，英雄随心搭配，团队默契合作，不做英雄养成，公平对战，还原你最初的游戏体验",
		"【王者荣耀模拟器特色三：策略对抗新模式，享棋牌模拟战得特色体验】",
		"全新英雄博弈策略对抗体验，众多阵营，8人成组，谁才是棋牌王者",
		"【王者荣耀模拟器特色四：守护对局，狄大人上线】",
		"信誉积分系统，优化匹配机制，不合理阵容重开，信誉奖励加码，全方位提升召唤师对局体验",
		"【王者荣耀模拟器特色五：全新智能键位，施法更加精准】",
		"腾讯手游模拟器，针对104个英雄深度适配，让每个英雄都有最合适的键位体验",
		"按键施法，完美适配，支持120帧，超清画质。在电脑大屏体验下畅享超神快感，王者荣耀电脑版，在电脑上全方位施展英雄策略，风骚走位，鼠标精准控制，王者之战一触即发。建议使用腾讯手游安卓模拟器《腾讯手游助手》效果更佳，腾讯手游助手安卓模拟器特有的引擎--AOW引擎保证了玩家操作上的快感体验，减少了游戏中滞后和卡顿。",
		"王者荣耀电脑版",
		"可以让你在大屏幕上享受到激烈的战斗，特别是腾讯手游模拟器可以通过以下几个方面提升你对王者荣耀电脑版的体验:",
		"*王者荣耀电脑版终极图形和视觉，独家支持2K分辨率。王者荣耀模拟器清晰的设置和高分辨率的地图可以帮助玩家迅速组织团队，防守来自敌人的进攻。特别是腾讯手游模拟器提供了《王者荣耀电脑版》的高清设置，这也保证了你在PC大屏幕环境下，沉浸在极限拼杀的场景中。",
		"*快速准确的控制器与鼠标键盘，灵活流畅地操控对于MOBA游戏玩家来说至关重要。腾讯手游模拟器特有的AOV引擎和自定义的keymapping功能，支持玩家流畅的游戏体验，提升了加载屏幕的速度，而不存在游戏的滞后性和卡滞性。",
		"*降低设备要求，最小2GB内存。关于王者荣耀电脑版内存占用，腾讯安卓模拟器可以将要求降低到2GB RAM，这将确保游戏占用更少的电脑存储空间。在PC上播放AOV也可以解决移动设备快速功耗的常见问题。",
	],
	index2_play: ["如何在电脑上用手游助手玩《王者荣耀》手游",
		"在官网下载手游助手模拟器",
		"运行 exe 文件完成安装",
		"打开手游助手模拟器并在右上方搜索栏输入王者荣耀",
		"在搜索结果中找到对应游戏并点击安装",
		"完成安装后，点击开始启动游戏",
		"在腾讯手游助手上畅玩王者荣耀电脑版",
	],

	index2_xgzx1: ["新英雄云缨上架仅3天，首位国服玩家出现，他的ID名字是重点",
		"王者荣耀这款游戏中的每个玩家都有自己本命的英雄，然后S24赛季开启之后游戏里也是上架了不少好看的皮肤，自然也是上架了...",
		"2021-06-25 21:06:00",
		"img/xgzx_2.png",
	],
	index2_xgzx2: ["13号迎来大更新，1万钻石别乱花，凤凰于飞优化上架，凤求凰返场保底抽",
		"王者荣耀13号要迎来一次大更新，去年五五开黑节后续13号也是进行了一次更新，这次活动时间也是一样的，看来天美的这个时间...",
		"2021-05-09 15:05:00",
		"img/xgzx_1.png",
	],
	index2_xgzx3: ["王者荣耀拿国标有多简单？小乔鲁班只需打9场，守约3场上国服",
		"又到了新的一个月，王者荣耀6月份的国标争夺战也是落下了帷幕，除了有“德华害我国标”这样的趣闻之外，还有暖阳国服第一镜...",
		"2021-07-01 18:07:00",
		"img/xgzx_3.png",
	],
}, {
	src: "img/lb5.png",
	h1: "迷你世界",
	h2: "迷你奇缘，星彩焕梦，全新联动开启",
	children_index_src: "img/child_tp5.png",
	index2_top: ["img/cs5.png", "迷你世界", "当前版本:1.0.1", "更新时间:2021-06-0315:06:00", "开发厂商:深圳市迷你玩科技有限...", "游戏分类:动作冒险",
		"游戏标签:沙盒", "高清画质 大屏畅享", "智能键位 还原端游", "安卓7.1 完美兼容", "极致多开 多屏操作", "自研引擎 极速畅快", "独家反外挂 公平竞技", "迷你世界 电脑版模拟器"
	],

	index2_xlbt: ["img/xlb51.png", "img/xlb52.png", "img/xlb53.png", "img/xlb54.png", "img/xlb55.png"],
	index2_text: ["",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"《迷你世界》是一款高度自由的3D沙盒游戏，这里没有等级和规则限制，这里没有特定的玩法，只有破坏和创造的乐趣；你可以创建一座城市，也可以养一群小动物，还可以挑战世界的黑暗领主，又可以制造火山洪水来改变世界。甚至可以把你的世界分享给其他小伙伴，一起欢乐。",
		"在迷你世界游戏世界里，玩家随时可以联机，超好玩。高度自由、休闲益智，有着非常方便快捷的多人联机模式，只要有网络就能和各个地方的小伙伴们一起玩，不只局限于局域网内的小伙伴哦！这里只有随心所欲的破坏和天马行空的创造！",
	],
	index2_play: ["如何在电脑上用手游助手玩《迷你世界》手游",
		"在官网下载手游助手模拟器",
		"运行 exe 文件完成安装",
		"打开手游助手模拟器并在右上方搜索栏输入迷你世界",
		"在搜索结果中找到对应游戏并点击安装",
		"完成安装后，点击开始启动游戏",
		"在腾讯手游助手上畅玩迷你世界电脑版",
	],
	index2_xgzx1: ["迷你世界最刺激的跑酷地图，全部都是炸药桶，电脑都给你卡崩溃",
		"苦瓜原创，翻版必究!《苦瓜电竞》--让你体验不一样的电竞主播圈!对于迷你世界玩家来说，跑酷可是游戏中最不能割舍的一个..",
		"2021-08-1021:08:00",
		"img/xgzx51.png",
	],
	index2_xgzx2: ["迷你世界全新版本，最惨的是野人，玩家各种泄愤上演关门打狗",
		"苦瓜原创，翻反必究!《苦瓜电竞》--让你体验不一样的电竞主播圈!对于迷你世界玩家来说，这段时间可是很忙碌的，毕竟迷你...",
		"2021-05-2112:05:00",
		"img/xgzx52.png",
	],
	index2_xgzx3: ["沙盒手游迷你世界，公开摇钱树制作方法，制成可无限刷钻石",
		"很多现实中的白日梦没办法实现!但是在游戏中却能够轻而易举的实现。例如最近一段时间迷你世界非常火爆，一方面是因为官司..",
		"2020-09-03 21:09:00",
		"img/xgzx53.png",
	],
}, {
	src: "img/lb6.jpeg",
	h1: "火影忍者",
	h2: "火之意志，格斗重燃",
	children_index_src: "img/child_tp6.jpeg",
	index2_top: ["img/cs6.png", "火影忍者", "当前版本:1.48.22.8", "更新时间:2021-07-27 02:07:00", "开发厂商:深圳市腾讯计算机系统...", "游戏分类:经营策略",
		"游戏标签:策略/二次元/漫改/...", "高清画质 大屏畅享", "智能键位 还原端游", "安卓7.1 完美兼容", "极致多开 多屏操作", "自研引擎 极速畅快", "独家反外挂 公平竞技",
		"火影忍者 电脑版模拟器"
	],
	index2_xlbt: ["img/xlb61.jfif", "img/xlb62.jfif", "img/xlb63.jfif", "img/xlb64.jfif", "img/xlb65.jfif"],
	index2_text: ["",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"",
		"火影忍者手游是一款腾讯自主研发由万代南梦宫授权的正版火影忍者格斗手游，100%原著剧情的还原，配合CG级华丽技能的表现，让喜爱火影动漫的你，体验到多角色的剧情人物扮演，酣畅淋漓的格斗体验让你重新点燃火之意志",
		"火影忍者电脑版游戏特色一： 正版授权，100%原著剧情体验 火影忍者作为一款官方唯一授权的正版火影格斗手游，原汁原味的剧情体验，原版的角色配音，CG级的动画特效，让你在回顾动漫的同时更沉浸在游戏的格斗体验。",
		"火影忍者电脑版游戏特色二： 格斗奥义连招，点燃火之意志 火影忍者作为一款格斗手游提供了角色专属的奥义技能，花样华丽的技能连招、酣畅淋漓的连击感受，带领火影迷们真切体验到激情的格斗爽快体验。",
		"使用火影忍者手游模拟器，键鼠操作连击更顺畅，大屏体验技能更华丽，火影忍者手游电脑版高清CG画质，完美兼容，无干扰推送，在电脑上全方位施展格斗技术，畅游奥义连招快感，键鼠极致操作，多键位自由设置，感受淋漓尽致的打击快感，建议使用腾讯手游安卓模拟器《腾讯手游助手》效果更佳，腾讯手游助手安卓模拟器独有的引擎--AOW引擎保证了玩家操作上的快感体验，减少了游戏中滞后和卡滞。",
	],
	index2_play: ["如何在电脑上用手游助手玩《火影忍者》手游",
		"在官网下载手游助手模拟器",
		"运行 exe 文件完成安装",
		"打开手游助手模拟器并在右上方搜索栏输入火影忍者",
		"在搜索结果中找到对应游戏并点击安装",
		"完成安装后，点击开始启动游戏",
		"在腾讯手游助手上畅玩火影忍者电脑版",
	],
	index2_xgzx1: ["为了成绩不择手段?FPX再次启用牛宝，知情人爆料:博人也在路上了!",
		"最近的FPX战队处于风口浪尖之中，他们的战绩也不是很稳定，特别是上单牛宝，发挥太差，一度被换了下去，但是在经过一场比...",
		"2021-07-12 00:07:00",
		"img/xgzx61.png",
	],
	index2_xgzx2: ["火影手游新高招A忍，须佐佐助最新爆料!一个出场动作百万人围观",
		"说起火影忍者相信很多小伙伴们都非常熟悉了，作为最具人气的热血动漫之一，它曾是很多人的青春，而火影忍者手游也是在国内...",
		"2021-06-3016:06:00",
		"img/xgzx62.png",
	],
	index2_xgzx3: ["CC2社长松山洋解释老游戏高清化的技术难题",
		"不但游戏开发商们希望将一些经典的老游戏强化画面后重新发售，就连玩家们也对此非常受用。那么把老游戏加强并重新发售真的...",
		"2020-09-10 10:09:00",
		"img/xgzx63.png",
	],
}, ]

console.log(lbts[0].index2_top)



var lbts2 = [{
	src: "img/dlb1.jpeg",
}, {
	src: "img/dlb2.jpeg",
}, {
	src: "img/dlb3.jpeg",
}, {
	src: "img/dlb4.jpeg",
}, {
	src: "img/dlb5.png",
}, {
	src: "img/dlb6.jpeg",
}, ]
for (var i = 0; i < lbts.length; i++) {
	var clone_li = lis[0].cloneNode()
	var clone_li2 = lis2[0].cloneNode()
	if (i == 0) {
		clone_li.style.opacity = 1
		clone_li.style.zIndex = 10
		// clone_li2.style.height = "110px"
		// clone_li2.style.width = "221px"
	}
	if (i == 0) {
		clone_li.innerHTML = '<img class="lb_imgs" src="' + lbts[i].src +
			'" width="100%" height="100%"><div class="msg1 animated bounceInRight"><h1>' + lbts[i].h1 + '</h1><h2>' +
			lbts[i].h2 +
			'</h2><a href="#">下载游戏</a></div>'
	} else if(i == 1 || i == 4 || i == 5){
		clone_li.innerHTML = '<img class="lb_imgs" src="' + lbts[i].src +
			'" width="100%" height="100%"><div class="msg1 animated right_msg"><h1>' + lbts[i].h1 + '</h1><h2>' +
			lbts[i].h2 +
			'</h2><a href="#">下载游戏</a></div>'
	}else {
		clone_li.innerHTML = '<img class="lb_imgs" src="' + lbts[i].src +
			'" width="100%" height="100%"><div class="msg1 animated "><h1>' + lbts[i].h1 + '</h1><h2>' + lbts[i].h2 +
			'</h2><a href="#">下载游戏</a></div>'
	}

	if (i == 0) {
		clone_li2.innerHTML = '<img src="' + lbts2[i].src + '" class="imgs_" style="width: 221px; height: 110px;">'
	} else {
		clone_li2.innerHTML = '<img src="' + lbts2[i].src + '" class="imgs_">'
	}
	ul1.appendChild(clone_li)
	ul2.appendChild(clone_li2)
}
lis[0].remove()
lis2[0].remove()


/*腾讯手游助手，享受最佳游戏体验*/
var g_right = document.getElementById("g_right")
var g_right_lis = g_right.children
var Game_zs = document.getElementById("game_zs")
var game_zs_s = Game_zs.children
// var g_left = document.getElementById("g_left")
var game_zs = [{
	xh: "1",
	p1: "智能助手，极致体验",
	p2: "王者智能施法 | 和平精英端游体验 | 无推送干扰",
	src: "img/zs1.png"
}, {
	xh: "2",
	p1: "海量游戏，完美兼容",
	p2: "键鼠手柄操作顺畅|丰富的直播和小说内容",
	src: "img/zs2.png"
}, {
	xh: "3",
	p1: "自研引擎，高速稳定",
	p2: "快速运行|占用内存小|无卡顿",
	src: "img/zs3.png"
}, {
	xh: "4",
	p1: "新游首发，独家特权",
	p2: "预约最新游戏│参加专题活动│获取独家礼包",
	src: "img/zs4.png"
}, ]

for (var i = 0; i < game_zs.length; i++) {
	var clone_g_right_lis = g_right_lis[0].cloneNode()
	var clone_game_zs_s = game_zs_s[1].cloneNode()
	if (i == 0) {
		clone_g_right_lis.classList.add("color_li")
		clone_game_zs_s.style.opacity = 1
	}
	clone_g_right_lis.innerHTML = '<div class="game_li-left"><span class="g-color">' + game_zs[i].xh +
		'</span></div><div class="game_li-right"><p class="g-p1 g-color">' + game_zs[i].p1 + '</p><p class="g-p2 g-color">' +
		game_zs[i].p2 + '</p></div>'
	clone_game_zs_s.innerHTML = '<img src="' + game_zs[i].src + '">'


	g_right.appendChild(clone_g_right_lis)
	Game_zs.appendChild(clone_game_zs_s)
}
g_right_lis[0].remove()
game_zs_s[1].remove()

/*热门游戏*/
var hotgame_box = document.getElementById("hotgame_box")
var hotgame_box_lis = hotgame_box.children
var rmyx = [{
	src1: "img/mg1.jpeg",
	msg1: "———2亿魂师推荐，真3D战斗手游———21年度国民级IP战斗手游巨作，由阅文集团和腾讯动画正版授权，2亿魂师推荐，和动画一模一样的《斗罗大陆：魂师对决》邀您一同创造全新斗罗宇宙！杨紫年度重磅推荐手游，超前人物设定剧透，全为每一位魂师心中的斗罗大陆，快下载与万千魂师，即刻对决！【游戏福利】1.登陆就送觉醒券，轻松打造专属超强魂师战队！2.夏日季福利送不停，专属魂师补贴，赠送高达800%！",
	src2: "img/xmg1.png",
	p1: "斗罗大陆",
	p2: "腾讯官方授权手游",
}, {
	src1: "img/mg2.jpeg",
	msg1: "《王者荣耀》是腾讯第一5V5团队公平竞技手游，国民MOBA手游大作！5V5王者峡谷、公平对战，还原MOBA经典体验；契约之战、五军对决、边境突围等，带来花式作战乐趣！10秒实时跨区匹配，与好友开黑上分，向最强王者进击！多款英雄任凭选择，一血、五杀、超神，实力碾压，收割全场！敌军即将到达战场，王者召唤师快来集结好友，准备团战，就在《王者荣耀》！",
	src2: "img/xmg2.png",
	p1: "王者荣耀",
	p2: "王者峡谷PVP",
}, {
	src1: "img/mg3.jpeg",
	msg1: "《武功来了》是一款武侠题材的塔防类策略手游，游戏将放置合成和塔防元素玩法相结合，轻操作，重策略，消除和策略的完美结合,从无到有建立起自己的专属编队，来迎接前方的各种挑战。你可以通过按照自己的喜好风格去收集和升级各种武侠角色，来发挥不同英雄的属性技能，去打败不同的敌人。有趣的玩法同时考验你的脑力和运气",
	src2: "img/xmg3.png",
	p1: "武功来了",
	p2: "超休闲武侠塔防",
}, {
	src1: "img/mg4.jpeg",
	msg1: "《和平精英》是腾讯光子工作室群自研打造的军事竞赛体验手游。虚幻引擎4研发，次世代完美画质，极致视听感受；超大实景地图，打造指尖战场，全方面自由施展战术；百人同场竞技，真实弹道，完美的射击手感；好友一键组队，语音开黑；腾讯光子工作室群超过300人团队研发，给您带来一场震撼的竞技体验。",
	src2: "img/xmg4.png",
	p1: "和平精英",
	p2: "绝地求生手游",
}, {
	src1: "img/mg5.jpeg",
	msg1: "火之意志，格斗重燃！《火影忍者》手游作为正版火影忍者格斗手游，由万代南梦宫授权、岸本齐史领衔集英社等版权方联合监修、腾讯游戏魔方工作室群自主研发而成。《火影忍者》手游100%正统还原原著剧情，疾风传篇章登场，十年百忍强力降临，玩家可以任意扮演鸣人、佐助、宇智波鼬等忍者，体验酣畅淋漓的忍术格斗连打和全屏奥义大招。此外，还可以进行跨服匹配2V2热血PK，参与无差别忍者格斗大赛，决出属于你的忍道！",
	src2: "img/xmg5.png",
	p1: "火影忍者",
	p2: "原汁原味实时PK",
}, {
	src1: "img/mg6.png",
	msg1: "《使命召唤手游》是使命召唤IP正版授权、天美J3工作室倾力打造的3A级枪战手游大作。游戏以高质量的视觉效果呈现游戏品质，高度还原使命召唤系列的经典玩法地图角色；不同的被动技能、终极技能及连续得分奖励的搭配，使得每个玩家都是独一无二的“英雄”存在！海量枪械配件及武器迷彩，枪械diy制定自己喜欢的样式。全",
	src2: "img/xmg6.png",
	p1: "使命召唤手游",
	p2: "cod正版手游",
}, {
	src1: "img/mg7.jpeg",
	msg1: "视觉革新，品质升级！全新面貌，欢乐无限~经典棋牌品牌，腾讯游戏精心打造，与全国玩家和亲朋好友一起《欢乐斗地主》！【精致的游戏体验】场景化的游戏界面，感受真实的斗地主；丰富趣味的动画，增添更多欢乐元素！【纯正的经典玩法】经典+癞子玩法，全民牌技PK！抢地主，明牌，加倍等玩法，对局乐趣精彩不停！【独特的排位玩法】得分升星冲段，角色百变，技能升级！赢牌只是第一步！【刺激的赛事玩法】丰富多样的赛事模式，品类丰富的奖池，海量好礼等你来赢！【丰富的棋牌合集】七雀牌、跑得快、自选牌、组队2V2、换三张等丰富有趣的创新玩法，轻松体验畅快玩~",
	src2: "img/xmg7.png",
	p1: "欢乐斗地主",
	p2: "全新面貌欢乐无限",
}, {
	src1: "img/mg8.jpeg",
	msg1: "《天龙八部》手游是一款全新3DMMO武侠手游，由“天龙八部”端游原班人马精心打造、腾讯代理的精品手游大作，既完美传承了端游核心特色和经典玩法，如老三环、燕子坞、珍珑棋局、夺宝马贼等，还有更多手游创新特色玩法；精致细腻的3D场景、实时便捷的交互体验、丰富多样的社交玩法，金戈铁马快意恩仇、最原汁原味的的正宗金庸武侠世界等你一起来体验！",
	src2: "img/xmg8.png",
	p1: "天龙八部手游",
	p2: "天龙八部武侠手游",
}, ]

for (var i = 0; i < rmyx.length; i++) {
	var clone_hotgame_box_lis = hotgame_box_lis[0].cloneNode()
	if (i == 0 || i == 4) {
		clone_hotgame_box_lis.style.paddingLeft = "0px"
	} else if (i == 3 || i == 7) {
		clone_hotgame_box_lis.style.paddingRight = "0px"
	}
	clone_hotgame_box_lis.innerHTML = '<div class="hotgame_img"><img src="' + rmyx[i].src1 +
		'"><div class="hotgame_img_text"><div class="hotgame_img_text2"><div class="hotgame_img_text3">' + rmyx[i].msg1 +
		'</div><div class="hotgame_img_text4"></div></div></div></div>    <div class="hotgame_download"><div class="hotgame_dl"><img class="hotgame_dl_img" src="' +
		rmyx[i].src2 + '" width="40px"><div class="hotgame_dl_text"><p>' + rmyx[i].p1 + '</p><span>' + rmyx[i].p2 +
		'</span></div></div><div class="hotgame_dr"><span>下载</span></div></div>'

	hotgame_box.appendChild(clone_hotgame_box_lis)
}
hotgame_box_lis[0].remove()

/*经销策略*/
var hotgame_box2 = document.getElementById("hotgame_box2")
var hotgame_box_lis2 = hotgame_box2.children
var jxcl = [{
	src1: "img/mg11.jpeg",
	msg1: "———2亿魂师推荐，真3D战斗手游———21年度国民级IP战斗手游巨作，由阅文集团和腾讯动画正版授权，2亿魂师推荐，和动画一模一样的《斗罗大陆：魂师对决》邀您一同创造全新斗罗宇宙！杨紫年度重磅推荐手游，超前人物设定剧透，全为每一位魂师心中的斗罗大陆，快下载与万千魂师，即刻对决！【游戏福利】1.登陆就送觉醒券，轻松打造专属超强魂师战队！2.夏日季福利送不停，专属魂师补贴，赠送高达800%！",
	src2: "img/x11.png",
	p1: "三国志",
	p2: "光荣正版授权",
}, {
	src1: "img/mg22.jpeg",
	msg1: "《王者荣耀》是腾讯第一5V5团队公平竞技手游，国民MOBA手游大作！5V5王者峡谷、公平对战，还原MOBA经典体验；契约之战、五军对决、边境突围等，带来花式作战乐趣！10秒实时跨区匹配，与好友开黑上分，向最强王者进击！多款英雄任凭选择，一血、五杀、超神，实力碾压，收割全场！敌军即将到达战场，王者召唤师快来集结好友，准备团战，就在《王者荣耀》！",
	src2: "img/x12.png",
	p1: "鸿图之下",
	p2: "沙盘三国战略手游",
}, {
	src1: "img/mg33.jpeg",
	msg1: "《武功来了》是一款武侠题材的塔防类策略手游，游戏将放置合成和塔防元素玩法相结合，轻操作，重策略，消除和策略的完美结合,从无到有建立起自己的专属编队，来迎接前方的各种挑战。你可以通过按照自己的喜好风格去收集和升级各种武侠角色，来发挥不同英雄的属性技能，去打败不同的敌人。有趣的玩法同时考验你的脑力和运气",
	src2: "img/x13.png",
	p1: "火影忍者",
	p2: "原汁原味实时PK",
}, {
	src1: "img/mg44.jpeg",
	msg1: "《和平精英》是腾讯光子工作室群自研打造的军事竞赛体验手游。虚幻引擎4研发，次世代完美画质，极致视听感受；超大实景地图，打造指尖战场，全方面自由施展战术；百人同场竞技，真实弹道，完美的射击手感；好友一键组队，语音开黑；腾讯光子工作室群超过300人团队研发，给您带来一场震撼的竞技体验。",
	src2: "img/x14.png",
	p1: "摩尔庄园",
	p2: "3D社区养成手游",
}, {
	src1: "img/mg55.jpeg",
	msg1: "火之意志，格斗重燃！《火影忍者》手游作为正版火影忍者格斗手游，由万代南梦宫授权、岸本齐史领衔集英社等版权方联合监修、腾讯游戏魔方工作室群自主研发而成。《火影忍者》手游100%正统还原原著剧情，疾风传篇章登场，十年百忍强力降临，玩家可以任意扮演鸣人、佐助、宇智波鼬等忍者，体验酣畅淋漓的忍术格斗连打和全屏奥义大招。此外，还可以进行跨服匹配2V2热血PK，参与无差别忍者格斗大赛，决出属于你的忍道！",
	src2: "img/x15.png",
	p1: "镇魂街",
	p2: "国漫IP正版授权PK",
}, {
	src1: "img/mg66.jpeg",
	msg1: "《使命召唤手游》是使命召唤IP正版授权、天美J3工作室倾力打造的3A级枪战手游大作。游戏以高质量的视觉效果呈现游戏品质，高度还原使命召唤系列的经典玩法地图角色；不同的被动技能、终极技能及连续得分奖励的搭配，使得每个玩家都是独一无二的“英雄”存在！海量枪械配件及武器迷彩，枪械diy制定自己喜欢的样式。全",
	src2: "img/x16.png",
	p1: "征服与霸业",
	p2: "沙盘战争策略手游",
}, {
	src1: "img/mg77.png",
	msg1: "视觉革新，品质升级！全新面貌，欢乐无限~经典棋牌品牌，腾讯游戏精心打造，与全国玩家和亲朋好友一起《欢乐斗地主》！【精致的游戏体验】场景化的游戏界面，感受真实的斗地主；丰富趣味的动画，增添更多欢乐元素！【纯正的经典玩法】经典+癞子玩法，全民牌技PK！抢地主，明牌，加倍等玩法，对局乐趣精彩不停！【独特的排位玩法】得分升星冲段，角色百变，技能升级！赢牌只是第一步！【刺激的赛事玩法】丰富多样的赛事模式，品类丰富的奖池，海量好礼等你来赢！【丰富的棋牌合集】七雀牌、跑得快、自选牌、组队2V2、换三张等丰富有趣的创新玩法，轻松体验畅快玩~",
	src2: "img/x17.png",
	p1: "公主连结",
	p2: "人气声优全新冒险",
}, {
	src1: "img/mg88.jpeg",
	msg1: "《天龙八部》手游是一款全新3DMMO武侠手游，由“天龙八部”端游原班人马精心打造、腾讯代理的精品手游大作，既完美传承了端游核心特色和经典玩法，如老三环、燕子坞、珍珑棋局、夺宝马贼等，还有更多手游创新特色玩法；精致细腻的3D场景、实时便捷的交互体验、丰富多样的社交玩法，金戈铁马快意恩仇、最原汁原味的的正宗金庸武侠世界等你一起来体验！",
	src2: "img/x18.png",
	p1: "少年三国志2",
	p2: "三国卡牌策略手游",
}, ]

for (var i = 0; i < jxcl.length; i++) {
	var clone_hotgame_box_lis2 = hotgame_box_lis2[0].cloneNode()
	if (i == 0 || i == 4) {
		clone_hotgame_box_lis2.style.paddingLeft = "0px"
	} else if (i == 3 || i == 7) {
		clone_hotgame_box_lis2.style.paddingRight = "0px"
	}
	clone_hotgame_box_lis2.innerHTML = '<div class="hotgame_img"><img src="' + jxcl[i].src1 +
		'"><div class="hotgame_img_text"><div class="hotgame_img_text2"><div class="hotgame_img_text3">' + jxcl[i].msg1 +
		'</div><div class="hotgame_img_text4"></div></div></div></div>    <div class="hotgame_download"><div class="hotgame_dl"><img class="hotgame_dl_img" src="' +
		jxcl[i].src2 + '" width="40px"><div class="hotgame_dl_text"><p>' + jxcl[i].p1 + '</p><span>' + jxcl[i].p2 +
		'</span></div></div><div class="hotgame_dr"><span>下载</span></div></div>'

	hotgame_box2.appendChild(clone_hotgame_box_lis2)
}
hotgame_box_lis2[0].remove()

/*角色扮演*/
var hotgame_box3 = document.getElementById("hotgame_box3")
var hotgame_box_lis3 = hotgame_box3.children
var jsby = [{
	src1: "img/mg31.jpeg",
	msg1: "———2亿魂师推荐，真3D战斗手游———21年度国民级IP战斗手游巨作，由阅文集团和腾讯动画正版授权，2亿魂师推荐，和动画一模一样的《斗罗大陆：魂师对决》邀您一同创造全新斗罗宇宙！杨紫年度重磅推荐手游，超前人物设定剧透，全为每一位魂师心中的斗罗大陆，快下载与万千魂师，即刻对决！【游戏福利】1.登陆就送觉醒券，轻松打造专属超强魂师战队！2.夏日季福利送不停，专属魂师补贴，赠送高达800%！",
	src2: "img/x31.png",
	p1: "秦时明月世界",
	p2: "秦时明月世界",
}, {
	src1: "img/mg32.jpeg",
	msg1: "《王者荣耀》是腾讯第一5V5团队公平竞技手游，国民MOBA手游大作！5V5王者峡谷、公平对战，还原MOBA经典体验；契约之战、五军对决、边境突围等，带来花式作战乐趣！10秒实时跨区匹配，与好友开黑上分，向最强王者进击！多款英雄任凭选择，一血、五杀、超神，实力碾压，收割全场！敌军即将到达战场，王者召唤师快来集结好友，准备团战，就在《王者荣耀》！",
	src2: "img/x32.png",
	p1: "坎特伯雷公主",
	p2: "像素风冒险手游",
}, {
	src1: "img/mg333.jpeg",
	msg1: "《武功来了》是一款武侠题材的塔防类策略手游，游戏将放置合成和塔防元素玩法相结合，轻操作，重策略，消除和策略的完美结合,从无到有建立起自己的专属编队，来迎接前方的各种挑战。你可以通过按照自己的喜好风格去收集和升级各种武侠角色，来发挥不同英雄的属性技能，去打败不同的敌人。有趣的玩法同时考验你的脑力和运气",
	src2: "img/x33.png",
	p1: "完美世界",
	p2: "还原端游大世界PK",
}, {
	src1: "img/mg34.jpeg",
	msg1: "《和平精英》是腾讯光子工作室群自研打造的军事竞赛体验手游。虚幻引擎4研发，次世代完美画质，极致视听感受；超大实景地图，打造指尖战场，全方面自由施展战术；百人同场竞技，真实弹道，完美的射击手感；好友一键组队，语音开黑；腾讯光子工作室群超过300人团队研发，给您带来一场震撼的竞技体验。",
	src2: "img/x34.png",
	p1: "刀剑神域",
	p2: "刀剑神域手游",
}, {
	src1: "img/mg35.jpeg",
	msg1: "火之意志，格斗重燃！《火影忍者》手游作为正版火影忍者格斗手游，由万代南梦宫授权、岸本齐史领衔集英社等版权方联合监修、腾讯游戏魔方工作室群自主研发而成。《火影忍者》手游100%正统还原原著剧情，疾风传篇章登场，十年百忍强力降临，玩家可以任意扮演鸣人、佐助、宇智波鼬等忍者，体验酣畅淋漓的忍术格斗连打和全屏奥义大招。此外，还可以进行跨服匹配2V2热血PK，参与无差别忍者格斗大赛，决出属于你的忍道！",
	src2: "img/x35.png",
	p1: "奇门之上",
	p2: "道风二次元手游",
}, {
	src1: "img/mg36.jpeg",
	msg1: "《使命召唤手游》是使命召唤IP正版授权、天美J3工作室倾力打造的3A级枪战手游大作。游戏以高质量的视觉效果呈现游戏品质，高度还原使命召唤系列的经典玩法地图角色；不同的被动技能、终极技能及连续得分奖励的搭配，使得每个玩家都是独一无二的“英雄”存在！海量枪械配件及武器迷彩，枪械diy制定自己喜欢的样式。全",
	src2: "img/x36.png",
	p1: "荣耀大天使",
	p2: "再战勇者大陆",
}, {
	src1: "img/mg37.jpeg",
	msg1: "视觉革新，品质升级！全新面貌，欢乐无限~经典棋牌品牌，腾讯游戏精心打造，与全国玩家和亲朋好友一起《欢乐斗地主》！【精致的游戏体验】场景化的游戏界面，感受真实的斗地主；丰富趣味的动画，增添更多欢乐元素！【纯正的经典玩法】经典+癞子玩法，全民牌技PK！抢地主，明牌，加倍等玩法，对局乐趣精彩不停！【独特的排位玩法】得分升星冲段，角色百变，技能升级！赢牌只是第一步！【刺激的赛事玩法】丰富多样的赛事模式，品类丰富的奖池，海量好礼等你来赢！【丰富的棋牌合集】七雀牌、跑得快、自选牌、组队2V2、换三张等丰富有趣的创新玩法，轻松体验畅快玩~",
	src2: "img/x37.png",
	p1: "天龙八部",
	p2: "天龙八部武侠手游",
}, {
	src1: "img/mg38.jpeg",
	msg1: "《天龙八部》手游是一款全新3DMMO武侠手游，由“天龙八部”端游原班人马精心打造、腾讯代理的精品手游大作，既完美传承了端游核心特色和经典玩法，如老三环、燕子坞、珍珑棋局、夺宝马贼等，还有更多手游创新特色玩法；精致细腻的3D场景、实时便捷的交互体验、丰富多样的社交玩法，金戈铁马快意恩仇、最原汁原味的的正宗金庸武侠世界等你一起来体验！",
	src2: "img/x38.png",
	p1: "原始传奇",
	p2: "传奇MMO手游",
}, ]

for (var i = 0; i < jxcl.length; i++) {
	var clone_hotgame_box_lis3 = hotgame_box_lis3[0].cloneNode()
	if (i == 0 || i == 4) {
		clone_hotgame_box_lis3.style.paddingLeft = "0px"
	} else if (i == 3 || i == 7) {
		clone_hotgame_box_lis3.style.paddingRight = "0px"
	}
	clone_hotgame_box_lis3.innerHTML = '<div class="hotgame_img"><img src="' + jsby[i].src1 +
		'"><div class="hotgame_img_text"><div class="hotgame_img_text2"><div class="hotgame_img_text3">' + jsby[i].msg1 +
		'</div><div class="hotgame_img_text4"></div></div></div></div>    <div class="hotgame_download"><div class="hotgame_dl"><img class="hotgame_dl_img" src="' +
		jsby[i].src2 + '" width="40px"><div class="hotgame_dl_text"><p>' + jsby[i].p1 + '</p><span>' + jsby[i].p2 +
		'</span></div></div><div class="hotgame_dr"><span>下载</span></div></div>'

	hotgame_box3.appendChild(clone_hotgame_box_lis3)
}
hotgame_box_lis3[0].remove()

/*体育竞速*/
var hotgame_box4 = document.getElementById("hotgame_box4")
var hotgame_box_lis4 = hotgame_box4.children
var tyjs = [{
	src1: "img/mg11.jpeg",
	msg1: "———2亿魂师推荐，真3D战斗手游———21年度国民级IP战斗手游巨作，由阅文集团和腾讯动画正版授权，2亿魂师推荐，和动画一模一样的《斗罗大陆：魂师对决》邀您一同创造全新斗罗宇宙！杨紫年度重磅推荐手游，超前人物设定剧透，全为每一位魂师心中的斗罗大陆，快下载与万千魂师，即刻对决！【游戏福利】1.登陆就送觉醒券，轻松打造专属超强魂师战队！2.夏日季福利送不停，专属魂师补贴，赠送高达800%！",
	src2: "img/x11.png",
	p1: "三国志",
	p2: "光荣正版授权",
}, {
	src1: "img/mg22.jpeg",
	msg1: "《王者荣耀》是腾讯第一5V5团队公平竞技手游，国民MOBA手游大作！5V5王者峡谷、公平对战，还原MOBA经典体验；契约之战、五军对决、边境突围等，带来花式作战乐趣！10秒实时跨区匹配，与好友开黑上分，向最强王者进击！多款英雄任凭选择，一血、五杀、超神，实力碾压，收割全场！敌军即将到达战场，王者召唤师快来集结好友，准备团战，就在《王者荣耀》！",
	src2: "img/x12.png",
	p1: "鸿图之下",
	p2: "沙盘三国战略手游",
}, {
	src1: "img/mg33.jpeg",
	msg1: "《武功来了》是一款武侠题材的塔防类策略手游，游戏将放置合成和塔防元素玩法相结合，轻操作，重策略，消除和策略的完美结合,从无到有建立起自己的专属编队，来迎接前方的各种挑战。你可以通过按照自己的喜好风格去收集和升级各种武侠角色，来发挥不同英雄的属性技能，去打败不同的敌人。有趣的玩法同时考验你的脑力和运气",
	src2: "img/x13.png",
	p1: "火影忍者",
	p2: "原汁原味实时PK",
}, {
	src1: "img/mg44.jpeg",
	msg1: "《和平精英》是腾讯光子工作室群自研打造的军事竞赛体验手游。虚幻引擎4研发，次世代完美画质，极致视听感受；超大实景地图，打造指尖战场，全方面自由施展战术；百人同场竞技，真实弹道，完美的射击手感；好友一键组队，语音开黑；腾讯光子工作室群超过300人团队研发，给您带来一场震撼的竞技体验。",
	src2: "img/x14.png",
	p1: "摩尔庄园",
	p2: "3D社区养成手游",
}, {
	src1: "img/mg55.jpeg",
	msg1: "火之意志，格斗重燃！《火影忍者》手游作为正版火影忍者格斗手游，由万代南梦宫授权、岸本齐史领衔集英社等版权方联合监修、腾讯游戏魔方工作室群自主研发而成。《火影忍者》手游100%正统还原原著剧情，疾风传篇章登场，十年百忍强力降临，玩家可以任意扮演鸣人、佐助、宇智波鼬等忍者，体验酣畅淋漓的忍术格斗连打和全屏奥义大招。此外，还可以进行跨服匹配2V2热血PK，参与无差别忍者格斗大赛，决出属于你的忍道！",
	src2: "img/x15.png",
	p1: "镇魂街",
	p2: "国漫IP正版授权PK",
}, {
	src1: "img/mg66.jpeg",
	msg1: "《使命召唤手游》是使命召唤IP正版授权、天美J3工作室倾力打造的3A级枪战手游大作。游戏以高质量的视觉效果呈现游戏品质，高度还原使命召唤系列的经典玩法地图角色；不同的被动技能、终极技能及连续得分奖励的搭配，使得每个玩家都是独一无二的“英雄”存在！海量枪械配件及武器迷彩，枪械diy制定自己喜欢的样式。全",
	src2: "img/x16.png",
	p1: "征服与霸业",
	p2: "沙盘战争策略手游",
}, {
	src1: "img/mg77.png",
	msg1: "视觉革新，品质升级！全新面貌，欢乐无限~经典棋牌品牌，腾讯游戏精心打造，与全国玩家和亲朋好友一起《欢乐斗地主》！【精致的游戏体验】场景化的游戏界面，感受真实的斗地主；丰富趣味的动画，增添更多欢乐元素！【纯正的经典玩法】经典+癞子玩法，全民牌技PK！抢地主，明牌，加倍等玩法，对局乐趣精彩不停！【独特的排位玩法】得分升星冲段，角色百变，技能升级！赢牌只是第一步！【刺激的赛事玩法】丰富多样的赛事模式，品类丰富的奖池，海量好礼等你来赢！【丰富的棋牌合集】七雀牌、跑得快、自选牌、组队2V2、换三张等丰富有趣的创新玩法，轻松体验畅快玩~",
	src2: "img/x17.png",
	p1: "公主连结",
	p2: "人气声优全新冒险",
}, {
	src1: "img/mg88.jpeg",
	msg1: "《天龙八部》手游是一款全新3DMMO武侠手游，由“天龙八部”端游原班人马精心打造、腾讯代理的精品手游大作，既完美传承了端游核心特色和经典玩法，如老三环、燕子坞、珍珑棋局、夺宝马贼等，还有更多手游创新特色玩法；精致细腻的3D场景、实时便捷的交互体验、丰富多样的社交玩法，金戈铁马快意恩仇、最原汁原味的的正宗金庸武侠世界等你一起来体验！",
	src2: "img/x18.png",
	p1: "少年三国志2",
	p2: "三国卡牌策略手游",
}, ]

for (var i = 0; i < tyjs.length; i++) {
	var clone_hotgame_box_lis4 = hotgame_box_lis4[0].cloneNode()
	if (i == 0 || i == 4) {
		clone_hotgame_box_lis4.style.paddingLeft = "0px"
	} else if (i == 3 || i == 7) {
		clone_hotgame_box_lis4.style.paddingRight = "0px"
	}
	clone_hotgame_box_lis4.innerHTML = '<div class="hotgame_img"><img src="' + tyjs[i].src1 +
		'"><div class="hotgame_img_text"><div class="hotgame_img_text2"><div class="hotgame_img_text3">' + tyjs[i].msg1 +
		'</div><div class="hotgame_img_text4"></div></div></div></div>    <div class="hotgame_download"><div class="hotgame_dl"><img class="hotgame_dl_img" src="' +
		tyjs[i].src2 + '" width="40px"><div class="hotgame_dl_text"><p>' + tyjs[i].p1 + '</p><span>' + tyjs[i].p2 +
		'</span></div></div><div class="hotgame_dr"><span>下载</span></div></div>'

	hotgame_box4.appendChild(clone_hotgame_box_lis4)
}
hotgame_box_lis4[0].remove()

/*动作冒险*/
var hotgame_box5 = document.getElementById("hotgame_box5")
var hotgame_box_lis5 = hotgame_box5.children
var dzmx = [{
	src1: "img/mg11.jpeg",
	msg1: "———2亿魂师推荐，真3D战斗手游———21年度国民级IP战斗手游巨作，由阅文集团和腾讯动画正版授权，2亿魂师推荐，和动画一模一样的《斗罗大陆：魂师对决》邀您一同创造全新斗罗宇宙！杨紫年度重磅推荐手游，超前人物设定剧透，全为每一位魂师心中的斗罗大陆，快下载与万千魂师，即刻对决！【游戏福利】1.登陆就送觉醒券，轻松打造专属超强魂师战队！2.夏日季福利送不停，专属魂师补贴，赠送高达800%！",
	src2: "img/x11.png",
	p1: "三国志",
	p2: "光荣正版授权",
}, {
	src1: "img/mg22.jpeg",
	msg1: "《王者荣耀》是腾讯第一5V5团队公平竞技手游，国民MOBA手游大作！5V5王者峡谷、公平对战，还原MOBA经典体验；契约之战、五军对决、边境突围等，带来花式作战乐趣！10秒实时跨区匹配，与好友开黑上分，向最强王者进击！多款英雄任凭选择，一血、五杀、超神，实力碾压，收割全场！敌军即将到达战场，王者召唤师快来集结好友，准备团战，就在《王者荣耀》！",
	src2: "img/x12.png",
	p1: "鸿图之下",
	p2: "沙盘三国战略手游",
}, {
	src1: "img/mg33.jpeg",
	msg1: "《武功来了》是一款武侠题材的塔防类策略手游，游戏将放置合成和塔防元素玩法相结合，轻操作，重策略，消除和策略的完美结合,从无到有建立起自己的专属编队，来迎接前方的各种挑战。你可以通过按照自己的喜好风格去收集和升级各种武侠角色，来发挥不同英雄的属性技能，去打败不同的敌人。有趣的玩法同时考验你的脑力和运气",
	src2: "img/x13.png",
	p1: "火影忍者",
	p2: "原汁原味实时PK",
}, {
	src1: "img/mg44.jpeg",
	msg1: "《和平精英》是腾讯光子工作室群自研打造的军事竞赛体验手游。虚幻引擎4研发，次世代完美画质，极致视听感受；超大实景地图，打造指尖战场，全方面自由施展战术；百人同场竞技，真实弹道，完美的射击手感；好友一键组队，语音开黑；腾讯光子工作室群超过300人团队研发，给您带来一场震撼的竞技体验。",
	src2: "img/x14.png",
	p1: "摩尔庄园",
	p2: "3D社区养成手游",
}, {
	src1: "img/mg55.jpeg",
	msg1: "火之意志，格斗重燃！《火影忍者》手游作为正版火影忍者格斗手游，由万代南梦宫授权、岸本齐史领衔集英社等版权方联合监修、腾讯游戏魔方工作室群自主研发而成。《火影忍者》手游100%正统还原原著剧情，疾风传篇章登场，十年百忍强力降临，玩家可以任意扮演鸣人、佐助、宇智波鼬等忍者，体验酣畅淋漓的忍术格斗连打和全屏奥义大招。此外，还可以进行跨服匹配2V2热血PK，参与无差别忍者格斗大赛，决出属于你的忍道！",
	src2: "img/x15.png",
	p1: "镇魂街",
	p2: "国漫IP正版授权PK",
}, {
	src1: "img/mg66.jpeg",
	msg1: "《使命召唤手游》是使命召唤IP正版授权、天美J3工作室倾力打造的3A级枪战手游大作。游戏以高质量的视觉效果呈现游戏品质，高度还原使命召唤系列的经典玩法地图角色；不同的被动技能、终极技能及连续得分奖励的搭配，使得每个玩家都是独一无二的“英雄”存在！海量枪械配件及武器迷彩，枪械diy制定自己喜欢的样式。全",
	src2: "img/x16.png",
	p1: "征服与霸业",
	p2: "沙盘战争策略手游",
}, {
	src1: "img/mg77.png",
	msg1: "视觉革新，品质升级！全新面貌，欢乐无限~经典棋牌品牌，腾讯游戏精心打造，与全国玩家和亲朋好友一起《欢乐斗地主》！【精致的游戏体验】场景化的游戏界面，感受真实的斗地主；丰富趣味的动画，增添更多欢乐元素！【纯正的经典玩法】经典+癞子玩法，全民牌技PK！抢地主，明牌，加倍等玩法，对局乐趣精彩不停！【独特的排位玩法】得分升星冲段，角色百变，技能升级！赢牌只是第一步！【刺激的赛事玩法】丰富多样的赛事模式，品类丰富的奖池，海量好礼等你来赢！【丰富的棋牌合集】七雀牌、跑得快、自选牌、组队2V2、换三张等丰富有趣的创新玩法，轻松体验畅快玩~",
	src2: "img/x17.png",
	p1: "公主连结",
	p2: "人气声优全新冒险",
}, {
	src1: "img/mg88.jpeg",
	msg1: "《天龙八部》手游是一款全新3DMMO武侠手游，由“天龙八部”端游原班人马精心打造、腾讯代理的精品手游大作，既完美传承了端游核心特色和经典玩法，如老三环、燕子坞、珍珑棋局、夺宝马贼等，还有更多手游创新特色玩法；精致细腻的3D场景、实时便捷的交互体验、丰富多样的社交玩法，金戈铁马快意恩仇、最原汁原味的的正宗金庸武侠世界等你一起来体验！",
	src2: "img/x18.png",
	p1: "少年三国志2",
	p2: "三国卡牌策略手游",
}, ]

for (var i = 0; i < dzmx.length; i++) {
	var clone_hotgame_box_lis5 = hotgame_box_lis5[0].cloneNode()
	if (i == 0 || i == 4) {
		clone_hotgame_box_lis5.style.paddingLeft = "0px"
	} else if (i == 3 || i == 7) {
		clone_hotgame_box_lis5.style.paddingRight = "0px"
	}
	clone_hotgame_box_lis5.innerHTML = '<div class="hotgame_img"><img src="' + dzmx[i].src1 +
		'"><div class="hotgame_img_text"><div class="hotgame_img_text2"><div class="hotgame_img_text3">' + dzmx[i].msg1 +
		'</div><div class="hotgame_img_text4"></div></div></div></div>    <div class="hotgame_download"><div class="hotgame_dl"><img class="hotgame_dl_img" src="' +
		dzmx[i].src2 + '" width="40px"><div class="hotgame_dl_text"><p>' + dzmx[i].p1 + '</p><span>' + dzmx[i].p2 +
		'</span></div></div><div class="hotgame_dr"><span>下载</span></div></div>'

	hotgame_box5.appendChild(clone_hotgame_box_lis5)
}
hotgame_box_lis5[0].remove()


//最新资讯，应有尽有
var zx1 = document.getElementById("zx1")
var zx1s = zx1.children
console.log(zx1s)
var zxzx = [{
	src: "img/zx1.jpeg",
	p1: "怎么用电脑玩俄罗斯方块环游记，俄罗斯方块环游记电脑版下载及设置",
	p2: "2021-07-16 06:07:00"
}, {
	src: "img/zx2.jpeg",
	p1: "和平精英电脑版下载_游戏下载及模拟器设置教程",
	p2: "2021-07-06 02:07:00"
}, {
	src: "img/zx3.jpeg",
	p1: "使命召唤手游电脑版下载_游戏下载及模拟器设置教程",
	p2: "2021-07-06 02:07:00"
}, {
	src: "img/zx4.jpeg",
	p1: "多款云游戏上线，带你全面了解云游特点！",
	p2: "2021-07-20 14:07:00"
}, {
	src: "img/zx5.jpeg",
	p1: "《鬼泣》和《巅峰之战》，花一分钟了解一下吧",
	p2: "2021-07-16 06:07:00"
}, {
	src: "img/zx6.jpeg",
	p1: "王者荣耀：新英雄云缨出装铭文推荐，高难度女英雄",
	p2: "2021-06-29 14:06:00"
}, ]
for (var i = 0; i < zxzx.length; i++) {
	var clone_zx1s = zx1s[0].cloneNode()
	if (i == 2 || i == 5) {
		clone_zx1s.style.marginRight = "0px"
	}
	clone_zx1s.innerHTML = '<div class="zx-img">\
			<img src="' + zxzx[i].src +
		'" width="100%">\
	</div>\
	<div class="zx-msg">\
		<p class="zx1-p1">' + zxzx[i].p1 + '</p>\
		<p class="zx1-p2">' +
		zxzx[i].p2 + '</p>\
	</div>\
		'
	zx1.appendChild(clone_zx1s)
}
zx1s[0].remove()

//FAQ 来这里，模拟器问题最优解决方案
var jq22 = document.getElementById("jq22")
var jq22s = jq22.children
var jjfa = [{
	sp: "穿越火线枪战王者下载",
	p: "穿越火线枪战王者下载很简单，只需要先下载安装《腾讯手游助手》，就能立即找到穿越火线下载安装游戏了。 《腾讯手游助手》业内首创IOS支持苹果区服随心畅玩！这里不止提供穿越火线枪战王者下载，还提供了和平精英电脑版下载以及更多的12000多款游戏下载哦！ 穿越火线枪战王者下载渠道当然是腾讯官方的才可靠，首选腾讯手游助手手机游戏模拟器。 用手机游戏模拟器玩手游，再也不用担心网络和电量的问题，尽情畅玩各种游戏。 手机模拟器相比手机，更具稳定性，不易出现闪退、卡顿等问题。 电脑也可以和手机好友一起玩游戏，这也是手机游戏模拟器的特性哦！ 手机模拟器的优点可远不止如此，比如用键鼠操控游戏，让你有更大的发挥空间。"
},{
	sp: "手机模拟器玩手游必看",
	p: "腾讯手游助手是腾讯官方出品的手机游戏模拟器，腾讯独家自研全新傲引擎，手机模拟器性能提高数倍不止，让大家在电脑上享受更为畅快的手游体验。\
		如果你还不知道安卓模拟器电脑版哪个好用的话，可以先下载安装腾讯手游助手，进入游戏体验一下就能够感受到舒适流畅地操作体验了。 用手机游戏模拟器玩手游，可以享受电脑大屏带来的震撼画面体验，这是手机无法比拟的。\
		在电脑上玩手游，使用电脑音箱或耳机，沉浸在游戏的世界里，充分享受游戏带来的快乐。 像是和平精英电脑版，可以戴上电脑罩耳式耳机，听声辩位更为精准，实力直接上了好几个档次！"
},{
	sp: "和平精英电脑版怎么玩",
	p: "首先你得在电脑上下载安装和平精英电脑版，如果不知道在哪下载的话，可以先下载腾讯手游助手，然后就可以找到和平精英电脑版下载安装了哦！下载过程中，我们不需要再进行其他操作，耐心等待和平精英电脑版下载安装完成即可游戏。\
		和平精英电脑版下载安装完成后，会自动启动游戏。接下来，我们只需要根据和平精英电脑版的指引，了解掌握基本操作就可以畅玩游戏啦！在电脑上玩手游，使用电脑音箱或耳机，沉浸在游戏的世界里，充分享受游戏带来的快乐。\
		像是和平精英电脑版，可以戴上电脑罩耳式耳机，听声辩位更为精准，实力直接上了好几个档次！ 用手机游戏模拟器玩手游，再也不用担心网络和电量的问题，尽情畅玩各种游戏。"
},{
	sp: "王者荣耀电脑版下载",
	p: "王者荣耀电脑版下载很简单，只需要先下载安装《腾讯手游助手》，就能立即找到王者荣耀电脑版下载了。\
		《腾讯手游助手》业内首创IOS支持苹果区服随心畅玩！这里不止提供王者荣耀电脑版下载，还提供了和平精英电脑版下载以及更多的12000多款游戏下载哦！\
		王者荣耀电脑版下载渠道当然是腾讯官方的才可靠，玩王者荣耀pc版首选腾讯手游助手手机游戏模拟器！ 用手机游戏模拟器玩手游，再也不用担心网络和电量的问题，尽情畅玩各种游戏。\
		手机模拟器相比手机，更具稳定性，不易出现闪退、卡顿等问题。 电脑也可以和手机好友一起玩游戏，这也是手机游戏模拟器的特性哦！"
},{
	sp: "安卓模拟器电脑版哪个好用",
	p: "腾讯手游助手是腾讯官方出品的手机游戏模拟器，腾讯独家自研全新傲引擎，手机模拟器性能提高数倍不止，让大家在电脑上享受更为畅快的手游体验。\
		如果你还不知道安卓模拟器电脑版哪个好用的话，可以先下载安装腾讯手游助手，进入游戏体验一下就能够感受到舒适流畅地操作体验了。 用手机游戏模拟器玩手游，可以享受电脑大屏带来的震撼画面体验，这是手机无法比拟的。\
		在电脑上玩手游，使用电脑音箱或耳机，沉浸在游戏的世界里，充分享受游戏带来的快乐。 像是和平精英电脑版，可以戴上电脑罩耳式耳机，听声辩位更为精准，实力直接上了好几个档次！"
},]
for(var i = 0; i< jjfa.length; i++){
	var clone_jq22s = jq22s[0].cloneNode()
	clone_jq22s.innerHTML = '<div class="gd-div">\
								<a href="####">\
									<div class="dgt">\
										<img src="img/fdj.png">\
										<span>'+jjfa[i].sp+'</span>\
									</div>\
									<div class="gd-msg">\
										<p>'+jjfa[i].p+'</p>\
									</div>\
								</a>\
							</div>'
	jq22.appendChild(clone_jq22s)
}
jq22s[0].remove()



//获取轮播图图片的点击事件,跳转页面并且传数据
var lb_imgs = document.getElementsByClassName("lb_imgs")
for (var i = 0; i < lis.length; i++) {
	lis[i].index = i
	lis[i].onclick = function() {
		var index = this.index
		console.log(lbts[index].children_index_src)
		window.open("index2.html")
		window.localStorage.setItem("src", lbts[index].children_index_src)
		//由于传过去的数组会变成字符串，传输页面数据加上JSON.stringify（），接收数据加上JSON.parse（）
		window.localStorage.setItem("index2_top", JSON.stringify(lbts[index].index2_top))
		window.localStorage.setItem("index2_xlbt", JSON.stringify(lbts[index].index2_xlbt))
		window.localStorage.setItem("index2_text", JSON.stringify(lbts[index].index2_text))
		window.localStorage.setItem("index2_play", JSON.stringify(lbts[index].index2_play))
		window.localStorage.setItem("index2_xgzx1", JSON.stringify(lbts[index].index2_xgzx1))
		window.localStorage.setItem("index2_xgzx2", JSON.stringify(lbts[index].index2_xgzx2))
		window.localStorage.setItem("index2_xgzx3", JSON.stringify(lbts[index].index2_xgzx3))

	}
}
