	// <!-- /* 导航栏 */ -->
	var CenterNav = document.getElementById("center_nav2");
	var CenterNav_list = CenterNav.children;
	//console.log(CenterNav_list[0]);
	var Nav_list=["热门游戏","角色扮演","动作冒险","体育竞技","经营策略","飞行射击","休闲益智","棋牌中心"];
	NvaList();
	function NvaList(){
		for(var j=0;j<Nav_list.length;j++){
			var clone_navli = CenterNav_list[0].cloneNode();
			clone_navli.innerHTML ='<span name="nav_sortapp">'+Nav_list[j]+'</span>';
			CenterNav.appendChild(clone_navli)
		}
		CenterNav.removeChild(CenterNav_list[0]);
	}
	

	//轮播图
	var swiper_wrapper =document.getElementsByClassName("swiper-wrapper");
	var swiperlist = swiper_wrapper[0].children;
	//console.log(swiper_slide[0].children[0].src);
	//console.log(swiper_slide[0].children[1]);
	
	var swiper_list = [	
		{
		img1:"img/swiper1.jpeg",
		title:"俄罗斯方块",
		text:"中国首款俄罗斯正版手游"
		},
		{
		img1:"img/swiper2.jpeg",
		title:"和平精英",
		text:"百人空投，绝地求生，超大地图还原端游体验"
		},
		{
		img1:"img/swiper3.jpeg",
		title:"赏金侦探",
		text:"悬疑推理，化身侦探，破案追凶"
		},
		{
		img1:"img/swiper4.jpeg",
		title:"罗布乐思",
		text:"创意沙盒游戏"
		},
		{
		img1:"img/swiper5.jpeg",
		title:"火影忍者",
		text:"3D周末庆独家福利，等你来领取"
	}];
	//轮播图
	swiperList(swiper_wrapper,swiperlist,swiper_list);
	function swiperList(swiper,swiperlist,swiper_text){
		for(var j=0;j<swiper_list.length;j++){
			var clone_swiper = swiperlist[0].cloneNode(true);
			clone_swiper.innerHTML='<div class="swiper-slide" >\
								<img src='+swiper_text[j].img1+'>\
								<div class="swiper-text">\
									<h1 class="swiper_title">'+swiper_text[j].title+'</h1>\
									<h2 class="swiper_title2">'+swiper_text[j].text+'</h2>\
									<div class="swiper_Downloadbtn">\
										<span>下载客户端</span>\
									</div>\
								</div>\
							</div>'	
			swiper[0].appendChild(clone_swiper);
		}
		swiper[0].removeChild(swiperlist[0]);
	}		

	
	//热门游戏000000000000000000000
	var hotgame_box = document.getElementsByClassName("hotgame_box");
	var hotgamebox_li = hotgame_box[0].children;
	var hotgame_list = [{
		hotgameimg1:"img/game_img1.jpeg",
		hotgameimg2:"img/game_pic1.png",
		title:"俄罗斯方块环游记",
		text1:"俄罗斯方块手游",
		text2:"Tetris官方正版授权俄罗斯方块手游，5亿人都玩过的经典之作，9项吉尼斯世界纪录。趣味关卡、竞技PK，丰富玩法，应有尽有。酣畅指尖，消除减压，休闲益智，老少咸宜。"
		},{
		hotgameimg1:"img/game_img2.jpeg",
		hotgameimg2:"img/game_pic2.png",
		title:"俄罗斯方块环游记",
		text1:"俄罗斯方块手游",
		text2:"Tetris官方正版授权俄罗斯方块手游，5亿人都玩过的经典之作，9项吉尼斯世界纪录。趣味关卡、竞技PK，丰富玩法，应有尽有。酣畅指尖，消除减压，休闲益智，老少咸宜。"
		},{
		hotgameimg1:"img/game_img3.jpeg",
		hotgameimg2:"img/game_pic3.png",
		title:"俄罗斯方块环游记",
		text1:"俄罗斯方块手游",
		text2:"Tetris官方正版授权俄罗斯方块手游，5亿人都玩过的经典之作，9项吉尼斯世界纪录。趣味关卡、竞技PK，丰富玩法，应有尽有。酣畅指尖，消除减压，休闲益智，老少咸宜。"
		},{
		hotgameimg1:"img/game_img4.jpeg",
		hotgameimg2:"img/game_pic4.png",
		title:"俄罗斯方块环游记",
		text1:"俄罗斯方块手游",
		text2:"Tetris官方正版授权俄罗斯方块手游，5亿人都玩过的经典之作，9项吉尼斯世界纪录。趣味关卡、竞技PK，丰富玩法，应有尽有。酣畅指尖，消除减压，休闲益智，老少咸宜。"
	}];
	hotgame();
	function hotgame(){
		for(var j=0;j<hotgame_list.length;j++){
			var clone_hotgame = hotgamebox_li[0].cloneNode(true);
			clone_hotgame.innerHTML = '<div class="hotgame_img">\
											<img src='+hotgame_list[j].hotgameimg1+' >\
											<div class="hotgame_img_text">\
												<div class="hotgame_img_text2">\
												<div class="hotgame_img_text3">\
													'+hotgame_list[j].text2+'\
											</div>\
											<div class="hotgame_img_text4">\
												游戏详情\
											</div>\
										</div>\
									</div>\
								</div>\
								<div class="hotgame_download">\
									<div class="hotgame_dl">\
										<img class="hotgame_dl_img" src='+hotgame_list[j].hotgameimg2+' >\
										<div class="hotgame_dl_text">\
											<p>'+hotgame_list[j].title+'</p>\
											<span>'+hotgame_list[j].text1+'</span>\
										</div>\
									</div>\
								<div class="hotgame_dr">\
									<span>下载</span>\
								</div>\
							</div>'
			hotgame_box[0].appendChild(clone_hotgame);
		}
		hotgame_box[0].removeChild(hotgamebox_li[0]);
	}
	
	// 游戏上传
	function allgame(sortapp1,sortapp2,dataText){
		for(var j=0;j<dataText.length;j++){
			//console.log(1);
			var clone_app = sortapp2[0].cloneNode(true);
			clone_app.innerHTML = '<div class="roleapp_box" onclick="GoTo_InformationPage(this)" gamevalue='+dataText[j].gamename+'>\
									<div class="roleapp_box_img">\
										<img src='+dataText[j].gameimg+' >\
									</div>\
									<div class="roleapp_box_txet">\
										<p>'+dataText[j].title+'</p>\
										<span>'+dataText[j].text1+'</span>\
									</div>\
									<div class="roleapp_box_txet2">\
										下载\
									</div>\
									<div class="roleapp_text">\
										<p>\
											'+dataText[j].computertext+'\
										</p>\
										<span>游戏详情</span>\
									</div>\
								</div>'
			sortapp1[0].appendChild(clone_app);
		}
		sortapp1[0].removeChild(sortapp2[0]);
	}
	
	// 角色扮演
	var roleapp = document.getElementsByClassName("Roleapp");
	var roleapp_li = roleapp[0].children;
	var  Roleapp_list = [
		{
			gamesort:"角色扮演",
			gamename:"斗罗大陆",
			gameimg:"img/app_img1.png",
			title:"斗罗大陆武魂觉醒",
			text1:"你从未见过的全新斗罗",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/dygame1.jpg","img/dygame2.jpg","img/dygame3.jpg","img/dygame4.jpg","img/dygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"荣耀大天使",
			gameimg:"img/app_img12.png",
			title:"荣耀大天使",
			text1:"迪丽热巴代言，谁是我的荣耀",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"荣耀大撒大声地天使",
			gameimg:"img/app_img12.png",
			title:"荣耀大天使",
			text1:"迪丽热巴代言，谁是我的荣耀",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"荣耀大天使",
			gameimg:"img/app_img12.png",
			title:"荣耀大天使",
			text1:"迪丽热巴代言，谁是我的荣耀",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"斗罗大陆",
			gameimg:"img/app_img1.png",
			title:"斗罗大陆武魂觉醒",
			text1:"你从未见过的全新斗罗",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
					"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
					"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
					"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
					"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
					"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"斗罗大陆",
			gameimg:"img/app_img1.png",
			title:"斗罗大陆武魂觉醒",
			text1:"你从未见过的全新斗罗",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
				
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"阿达",
			gameimg:"img/app_img12.png",
			title:"啊实打实大师",
			text1:"迪丽热巴代言，谁是我的荣耀",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"荣耀大天使",
			gameimg:"img/app_img12.png",
			title:"荣耀大天使",
			text1:"迪丽热巴代言，谁是我的荣耀",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"斗罗大陆",
			gameimg:"img/app_img1.png",
			title:"斗罗大陆武魂觉醒",
			text1:"你从未见过的全新斗罗",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
					+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
					+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
					+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"荣耀大天使",
			gameimg:"img/app_img12.png",
			title:"荣耀大天使",
			text1:"迪丽热巴代言，谁是我的荣耀",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"斗罗大陆",
			gameimg:"img/app_img1.png",
			title:"斗罗大陆武魂觉醒",
			text1:"你从未见过的全新斗罗",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
					+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
					+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
					+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"角色扮演",
			gamename:"斗罗大陆",
			gameimg:"img/app_img1.png",
			title:"斗罗大陆武魂觉醒",
			text1:"你从未见过的全新斗罗",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
	];
	//console.log(Role_appbox_list.length);
	allgame(roleapp,roleapp_li,Roleapp_list);
	
	// 动作冒险
	var actapp = document.getElementsByClassName("Actapp");
	var actapp_li = actapp[0].children;
//	allgame(actapp,actapp_li,Role_appbox_list,Actapp_list);
	var Actapp_list = [
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"动作冒险",
			gamename:"明日之后（半感染者）",
			gameimg:"img/app_img21.png",
			title:"明日之后（半感染者）",
			text1:"加入未知，活下去",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
	];
	//console.log(Actapp_list.length);
	allgame(actapp,actapp_li,Actapp_list);
	
	// 体育竞技
	var Sportapp = document.getElementsByClassName("Sportapp");
	var Sportapp_li = Sportapp[0].children;
	var Sportapp_list = [
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"体育竞技",
			gamename:"QQ飞车手游",
			gameimg:"img/app_img31.png",
			title:"QQ飞车手游",
			text1:"唯一官方正版手游，体验最原汁原味的漂移！",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		
	];
	//console.log(Actapp_list.length);
	allgame(Sportapp,Sportapp_li,Sportapp_list);
		
	//经营策略
	var Manegeapp = document.getElementsByClassName("Manegeapp");
	var Manegeapp_li = Manegeapp[0].children;
	var Manegeapp_list = [
		{
			gamesort:"经营策略",
			gamename:"三国志・战略版（郭德纲代言）",
			gameimg:"img/app_img41.png",
			title:"三国志・战略版（郭德纲代言）",
			text1:"郭德纲力荐五千万战略家真实战场",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"三国志・战略版（郭德纲代言）",
			gameimg:"img/app_img41.png",
			title:"三国志・战略版（郭德纲代言）",
			text1:"郭德纲力荐五千万战略家真实战场",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"三国志・战略版（郭德纲代言）",
			gameimg:"img/app_img41.png",
			title:"三国志・战略版（郭德纲代言）",
			text1:"郭德纲力荐五千万战略家真实战场",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"三国志・战略版（郭德纲代言）",
			gameimg:"img/app_img41.png",
			title:"三国志・战略版（郭德纲代言）",
			text1:"郭德纲力荐五千万战略家真实战场",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"三国志・战略版（郭德纲代言）",
			gameimg:"img/app_img41.png",
			title:"三国志・战略版（郭德纲代言）",
			text1:"郭德纲力荐五千万战略家真实战场",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"小森生活",
			gameimg:"img/app_img42.png",
			title:"小森生活",
			text1:"不期而遇，治愈之美",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"小森生活",
			gameimg:"img/app_img42.png",
			title:"小森生活",
			text1:"不期而遇，治愈之美",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"小森生活",
			gameimg:"img/app_img42.png",
			title:"小森生活",
			text1:"不期而遇，治愈之美",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"小森生活",
			gameimg:"img/app_img42.png",
			title:"小森生活",
			text1:"不期而遇，治愈之美",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"经营策略",
			gamename:"小森生活",
			gameimg:"img/app_img42.png",
			title:"小森生活",
			text1:"不期而遇，治愈之美",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		
	];
	//console.log(Actapp_list.length);
	allgame(Manegeapp,Manegeapp_li,Manegeapp_list);
	
	// 飞行射击
	var Flyapp = document.getElementsByClassName("Flyapp");
	var Flyapp_li = Flyapp[0].children;
	var Flyapp_list = [
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		}, 
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		{
			gamesort:"飞行射击",
			gamename:"使命召唤手游",
			gameimg:"img/app_img51.png",
			title:"使命召唤手游",
			text1:"使命召唤正版授权，3A级枪战手游大作",
			press:"安徽尚趣玩网络科技有限公司",
			gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
						+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
						+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
						+"即将荣耀启航，踏上勇者旅途！"
						+"【游戏特色】"
						+"【一人三职，单人即可成团】"			
						+"【宗门养成，重铸荣光再建唐门】"
						+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
						+"【次世技能，缔造史诗特效】"
						+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
						+"【推图闯关，探索异域地图】"
						+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
						+"【多维社交，激活交互能量】"
						+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
						+"【贴心护肝，轻松解放双手】"
						+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
			playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
		},
		
	];
	//console.log(Actapp_list.length);
	allgame(Flyapp,Flyapp_li,Flyapp_list);
	
	// 休闲益智
	var Restapp = document.getElementsByClassName("Restapp");
	var Restapp_li = Restapp[0].children;
	var Restapp_list = [
		{
			gamesort:"休闲益智",
			gamename:"偶像梦幻祭2",
			gameimg:"img/app_img61.png",
			title:"偶像梦幻祭2",
			text1:"“这里有，偶像们的一切”",
			press:"北京零壹元素网络科技有限公司",
			gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
								
			playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
								"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
								"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
								"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
								"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
								"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
			gamesort:"休闲益智",
			gamename:"偶像梦幻祭2",
			gameimg:"img/app_img61.png",
			title:"偶像梦幻祭2",
			text1:"“这里有，偶像们的一切”",
			press:"北京零壹元素网络科技有限公司",
			gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
									
			playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
						gamesort:"休闲益智",
						gamename:"偶像梦幻祭2",
						gameimg:"img/app_img61.png",
						title:"偶像梦幻祭2",
						text1:"“这里有，偶像们的一切”",
						press:"北京零壹元素网络科技有限公司",
						gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
						computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
						computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
									
						playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
						gamesort:"休闲益智",
						gamename:"偶像梦幻祭2",
						gameimg:"img/app_img61.png",
						title:"偶像梦幻祭2",
						text1:"“这里有，偶像们的一切”",
						press:"北京零壹元素网络科技有限公司",
						gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
						computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
						computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
									
						playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
						gamesort:"休闲益智",
						gamename:"偶像梦幻祭2",
						gameimg:"img/app_img61.png",
						title:"偶像梦幻祭2",
						text1:"“这里有，偶像们的一切”",
						press:"北京零壹元素网络科技有限公司",
						gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
						computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
						computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
									
						playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
						gamesort:"休闲益智",
						gamename:"偶像梦幻祭2",
						gameimg:"img/app_img61.png",
						title:"偶像梦幻祭2",
						text1:"“这里有，偶像们的一切”",
						press:"北京零壹元素网络科技有限公司",
						gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
						computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
						computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
									
						playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
			gamesort:"休闲益智",
			gamename:"偶像梦幻祭2",
			gameimg:"img/app_img61.png",
			title:"偶像梦幻祭2",
			text1:"“这里有，偶像们的一切”",
			press:"北京零壹元素网络科技有限公司",
			gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
								
			playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
			gamesort:"休闲益智",
			gamename:"偶像梦幻祭2",
			gameimg:"img/app_img61.png",
			title:"偶像梦幻祭2",
			text1:"“这里有，偶像们的一切”",
			press:"北京零壹元素网络科技有限公司",
			gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
									
			playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
			gamesort:"休闲益智",
			gamename:"偶像梦幻祭2",
			gameimg:"img/app_img61.png",
			title:"偶像梦幻祭2",
			text1:"“这里有，偶像们的一切”",
			press:"北京零壹元素网络科技有限公司",
			gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
									+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
									+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
									+"游戏角色均是由次世代标准的3D模型烘培而成，"
									+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
									+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
									+"即将荣耀启航，踏上勇者旅途！"
									+"【游戏特色】"
									+"【一人三职，单人即可成团】"			
									+"【宗门养成，重铸荣光再建唐门】"
									+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
									+"【次世技能，缔造史诗特效】"
									+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
									+"【推图闯关，探索异域地图】"
									+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
									+"【多维社交，激活交互能量】"
									+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
									+"【贴心护肝，轻松解放双手】"
									+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
									
			playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
									"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
									"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
									"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
									"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
									"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
			gamesort:"休闲益智",
			gamename:"偶像梦幻祭2",
			gameimg:"img/app_img61.png",
			title:"偶像梦幻祭2",
			text1:"“这里有，偶像们的一切”",
			press:"北京零壹元素网络科技有限公司",
			gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
										+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
										+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
										+"游戏角色均是由次世代标准的3D模型烘培而成，"
										+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
										+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
										+"即将荣耀启航，踏上勇者旅途！"
										+"【游戏特色】"
										+"【一人三职，单人即可成团】"			
										+"【宗门养成，重铸荣光再建唐门】"
										+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
										+"【次世技能，缔造史诗特效】"
										+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
										+"【推图闯关，探索异域地图】"
										+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
										+"【多维社交，激活交互能量】"
										+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
										+"【贴心护肝，轻松解放双手】"
										+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
										
				playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
										"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
										"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
										"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
										"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
										"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
			gamesort:"休闲益智",
			gamename:"偶像梦幻祭2",
			gameimg:"img/app_img61.png",
			title:"偶像梦幻祭2",
			text1:"“这里有，偶像们的一切”",
			press:"北京零壹元素网络科技有限公司",
			gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
			computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
			computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
								
			playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
								"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
								"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
								"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
								"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
								"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
				},
		{
		gamesort:"休闲益智",
		gamename:"偶像梦幻祭2",
		gameimg:"img/app_img61.png",
		title:"偶像梦幻祭2",
		text1:"“这里有，偶像们的一切”",
		press:"北京零壹元素网络科技有限公司",
		gametext1:["1.7.2045","休闲益智","2021-07-22 17:07:00","二次元 / 女性向","北京零壹元素网络科技有限公司"],
		computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
		computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
								
		playreason:["必玩偶像梦幻祭2电脑版的几大理由：",
					"偶像梦幻祭2电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
					"偶像梦幻祭2电脑版，摆脱手机电量担忧，网络状态更加稳定",
					"偶像梦幻祭2电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
					"偶像梦幻祭2电脑版，键鼠操控拥有更大发挥空间",
					"偶像梦幻祭2电脑版是腾讯官方认证的偶像梦幻祭2模拟器，具有更好的游戏稳定性"]
	},
	]
	//console.log(Actapp_list.length);
	allgame(Restapp,Restapp_li,Restapp_list);
	
	//棋牌中心
	var Chessapp = document.getElementsByClassName("Chessapp");
	var Chessapp_li = Chessapp[0].children;
	var Chessapp_list = [
		{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
							
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
								
				playreason:["必玩荣耀大天使电脑版的几大理由：",
						"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
						"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
						"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
						"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
						"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
							+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
							+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
							+"游戏角色均是由次世代标准的3D模型烘培而成，"
							+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
							+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
							+"即将荣耀启航，踏上勇者旅途！"
							+"【游戏特色】"
							+"【一人三职，单人即可成团】"			
							+"【宗门养成，重铸荣光再建唐门】"
							+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
							+"【次世技能，缔造史诗特效】"
							+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
							+"【推图闯关，探索异域地图】"
							+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
							+"【多维社交，激活交互能量】"
							+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
							+"【贴心护肝，轻松解放双手】"
							+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
					
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
						+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
						+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
						+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
			{
				gamesort:"棋牌中心",
				gamename:"欢乐斗地主",
				gameimg:"img/app_img71.png",
				title:"欢乐斗地主（腾讯）",
				text1:"随时随地斗地主",
				press:"安徽尚趣玩网络科技有限公司",
				gametext1:["1.10.29","角色扮演","2021-08-06 16:08:00","魔幻 / MMORPG","安徽尚趣玩网络科技有限公司"],
				computerimg:["img/yygame1.jpg","img/yygame2.jpg","img/yygame3.jpg","img/yygame4.jpg","img/yygame5.jpg"],
				computertext:"荣耀回归，再战勇者大陆！"
								+"《荣耀大天使》是一款次世代的大型多人在线魔幻3D手游，"
								+"采用当前先进的3D实时成像引擎，创造独有的细微人物肢体动作和暗黑魔幻世界背景。"
								+"游戏角色均是由次世代标准的3D模型烘培而成，"
								+"搭配4K的画面表现与极具视觉冲击力的变身特效，"
								+"让玩家真正体验到纵横大陆的畅快感！伟大的勇士，您准备好了吗？ "
								+"即将荣耀启航，踏上勇者旅途！"
								+"【游戏特色】"
								+"【一人三职，单人即可成团】"			
								+"【宗门养成，重铸荣光再建唐门】"
								+"一人三职，技能远攻近扛；多维加点培养，自由探索阵容；带来全新阵容体验。"						
								+"【次世技能，缔造史诗特效】"
								+"招牌神技，演绎超神收割；灵活搭配，缔造团战传说；享受精彩视觉盛宴。"
								+"【推图闯关，探索异域地图】"
								+"大漠孤烟、冰天雪地、神秘海底，百千异域。探索无限未知，收获海量钻石。"
								+"【多维社交，激活交互能量】"
								+"特色战盟，盟友多维助力；市场交易系统，自由买卖装备；颠覆传统社交桎梏。"
								+"【贴心护肝，轻松解放双手】"
								+"挂机系统，保姆式护肝体验；自助多开，坐享海量经验；体验一夜战力飞升。",
						
				playreason:["必玩荣耀大天使电脑版的几大理由：",
							"荣耀大天使电脑版可与手机好友一同畅玩，和好友们一起畅游游戏世界",
							"荣耀大天使电脑版，摆脱手机电量担忧，网络状态更加稳定",
							"荣耀大天使电脑版，用电脑屏幕玩手游，大屏游戏更加畅快",
							"荣耀大天使电脑版，键鼠操控拥有更大发挥空间",
							"荣耀大天使电脑版是腾讯官方认证的荣耀大天使模拟器，具有更好的游戏稳定性"]
			},
		
	]
	//console.log(Actapp_list.length);
	allgame(Chessapp,Chessapp_li,Chessapp_list);
	
	// <!-- // 游戏分类 每列第四第五个 文本向右移动 -->
	MoveGame();
	function MoveGame(){
		var roleapptext= document.getElementsByClassName("roleapp_text");
		// 游戏分类 每列第四第五个 文本向右移动
		for(var i=0;i<roleapptext.length;i++){
			if(i!=0&&i%6==4 || i!=0&&i%6==5){
				roleapptext[i].classList.add("roleapp_text2");
			//	console.log(i);
			}
			else{
				roleapptext[i].classList.add("roleapp_text1");
			}
		}
	}
	
	
	